InformationRegisters/СогласованиеЦенАкция.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СогласованиеЦенАкция</Name>
			<Comment>Согласование цен с контрагентами*</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена номенклатуры для контрагента</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаБезНДС</Name>
					<Comment>Цена номенклатуры для контрагента без учета налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Comment>Срок действия цен</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентОтклонения</Name>
					<Comment>Процент отклонения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор взаиморасчетов контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Comment>(АСУ) Характеристика/серия номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СогласованиеЦенАкция/Ext/RecordSetModule.bsl
Перем ДокументОбъект Экспорт;
Перем Контрагент Экспорт;
Перем ДоговорВзаиморасчетов Экспорт;
Перем СрокДействия Экспорт;
Перем ДатаНачалаДействия Экспорт;
Перем ЗаписыватьДвижения Экспорт;
Перем РезультатЗапросаПоТоварам Экспорт;
Перем ПроцентОтклонения Экспорт;

// устанавливает цены для контрагентов по товарам на заданный период
Функция УстановитьЦены() Экспорт
	Записывать = Истина;
	ВыборкаДанных=РезультатЗапросаПоТоварам.Выбрать();
	// перебираем выборку и делаем по ней движения
	Пока ВыборкаДанных.Следующий() Цикл
		НоваяЗапись=Добавить();
		НоваяЗапись.Период=ДатаНачалаДействия;//ДокументОбъект.Дата;
		НоваяЗапись.Регистратор=ДокументОбъект;
		НоваяЗапись.Контрагент=Контрагент;
		НоваяЗапись.ДоговорВзаиморасчетов=ДоговорВзаиморасчетов;
		НоваяЗапись.Номенклатура=ВыборкаДанных.Номенклатура;
		НоваяЗапись.Цена=ВыборкаДанных.Цена;
		НоваяЗапись.ЦенаБезНДС=ВыборкаДанных.ЦенаБезНДС;
		НоваяЗапись.СрокДействия=СрокДействия;
		НоваяЗапись.блЦенаИзготовителя=ВыборкаДанных.блЦенаИзготовителя;
		//LionH 25.08.2009
		НоваяЗапись.Характеристика=ВыборкаДанных.Характеристика;
		НоваяЗапись.ПроцентОтклонения=ПроцентОтклонения;
		//LionE 25.08.2009
	КонецЦикла;
	
	ДокументОбъект=Неопределено;
	РезультатЗапросаПоТоварам=Неопределено;
	
	Возврат Истина;
КонецФункции
